export const ENCIRCLE_DATA = [
  `共产国际于 1931 年 1 月 11 日致电共产国际远东局和中共中央，指示说: “宜将各军( 特别第 1、2 军和第 3 军) 的主要核心撤到较为安全的地区，从中组织有坚固根据地的正规军骨干力量，无论如何要将其保护好，使其不至于在敌人集中优势兵力围剿时所进行的冒险行动中遭到被歼灭的危险。关于根据地问题，同意必须进行顽强的斗争，把赣南基本的最主要的根据地保持在我们手里。但考虑到军队的主要核心力量在敌人压迫下有暂时被迫撤退的可能性，我们认为，现在采取措施在湘西南和黔桂交界地区筹建辅助区是适宜的。同时务必更加重视在鄂湘川交界地区建立第二个主要根据地。”
  1930年12月上旬
  蒋介石拼凑杂牌军10万人，采取“分进合击，长驱直入”的办法，分南北两路进击。
  红军根据“敌强我弱，敌大我小”的特点，红一方面军采取“诱敌深入”的方针，粉碎了国民党第一次围剿。
  
  `,
  `远东局于 1931 年 2 月 22 日至 28 日从上海发出的致共产国际执委会信中说到: “现在我们处在军阀第二次进攻的前夕，敌人对这次进攻作了更为精心的准备，打算投入更多的兵力来对付我们。我们依然坚持在前一封信中提到的任务和指示。保卫吉安中心，建立‘成片苏维埃化’的地区———不留下反动策源地。在对我们不利的条件下不进行决定性的战斗。从必须保存红军有生力量出发，以进一步壮大和巩固红军为使命。
  1931年4月初
  蒋介石调集20万人，采取“稳扎稳打，步步为营”的作战方针。
  红军依旧采用“诱敌深入”的作战方针，隐藏主力，从江西赣江边上富田打到福建建宁
  
  `,
  `蒋介石调集三十万军队，以嫡系部队为主力，自任总司令，重新采取“长驱直入”、“分进合击”的打法。
红军仍然只有三万人左右，且主力仍在建宁，方面军总前委采取“避敌主力，打其虚弱”的方针，从建宁绕道而行回师赣南。

  `,
  `1932年7月，国民党军约30万人，首先对鄂豫皖苏区进行“围剿”。
  红军内部，由于张国焘盲目轻敌，认为要“打败红军就必须由帝国主义亲自出马”。反围剿失败后，决定红军主力“暂时离开苏区向外转移”，鄂豫皖苏区被放弃。
  红四方面军离开鄂豫皖苏区，于1932年进入川陕地区，1933年2月川陕苏维埃政府在通江成立，红四军发展壮大。
  蒋介石以10万兵力攻打湘鄂西苏区。
  红军由于肃反和“左”倾冒险主义而反围剿失败，主力在10月撤入湘鄂川黔边地区。
  1933年10月上旬，宁都会议继续贯彻“左”倾路线，将毛泽东调到后方。
  1933年一月中共中央从上海迁入苏区指挥第四次反围剿。第四次反围剿成功，中央苏区进入全盛时期。
  “左倾”错误在第四次反围剿后依然存在。
  
  `,
  `蒋介石在军事上开始实施强硬手段：庐山“军官训练团”（练兵,从国外购买军火；聘请外国专家作为顾问，研究新的战术；
    调动100万军队、两百架飞机，分四路围剿中央苏区。
    李德、博古废除积极防御作战方针，使装备较差的红军直面国民党军，必然失败。
    1933年11月，福建事变发生，蒋介石抽出主力镇压，但博古等人延误战机，在政治上继续“肃清”，丧失打破第五次围剿的好时机。
    1934年1月，在瑞金召开会议，将“左”倾冒险主义发展到极点，导致第五次反围剿失败。
    5月，中央书记处准备将红军主力撤出中央根据地。`
]