export type ILogType = {
  date: string,
  text: string
}
export const LOG_DATA: ILogType[] = [
  {
    date: "1934年10月1日",
    text: `
    今天！

    我终于成为！

    一名光荣的红军战士了！  
    
    `
  },
  {
    date: ' 1934年10月12日',
    text: `
    其实这次根据地的转移，战士们之间都早有传闻。但这传闻从春天刚种庄稼时穿到现在，庄稼都下第二道的时候，终于应了验。
  我对离开，于理论是很赞同的，毕竟现在也确实是“敌强我弱”，我们不得不走。可是心里却很舍不得这片地方，虽然我并不生在这片土地。
我的故乡是甘肃西谷县岷山脚下的一个小山村。1929年的秋天，秋霜刚打过，冯玉祥“抽丁”征兵，我被征入伍，那年我才19岁。
1931年，我参加了宁都起义，加入了红军。红军和原来的军阀部队完全不一样：他们受到老百姓的欢迎；官兵之间没有间隙，就好似一家人一样；待人也十分和气。
我是打心眼里觉得“红军真好！”，而这片根据地，这片根据地上的人们。怎么看怎么好。离开那头晚上，我难受的睡不着。想着之前吃的败仗，我发誓要打回家乡去，让家乡的人民也过上好日子。

    `
  },
  {
    date: '1934年10月23日',
    text: `
    我今天交了个新伙伴。他叫李大柱，也是甘肃人。只不过和我这个后来并入组织的不一样，大柱哥是受“革命感召”加入的红军。
    他和我说：“咱们老百姓的日子苦啊，受各方面的压迫，咱们不能甘于被压迫，咱们要反抗！”他还和我说了好多话，我没读过书，不大能听得懂，但我觉得大柱哥说得对。因为他的话是在为我们穷人谋利益哩！我得向大柱哥拜个师，好好学习那些理论，才能更好的为我们的革命事业奋斗哇！
    人逢喜事精神爽。我不仅交到了新朋友，我们还打了个漂亮的突围战，粉碎了敌人的封锁。这样看来，我们的革命，有像我、像李大柱、像其他战友以及今日这样的胜仗，还愁不能成功吗？？
    
    `
  },
  {
    date: '1934年11月6日',
    text: `
    这段时间，队伍缺粮真是缺得慌。
我已经两天两夜没吃饭了，肚子饿得直泛酸水，勉强还能赶路。但大柱哥就差太多了。他把自己的那点菜根子都分给了年龄大些的老兵和伤员，自己几天几夜都靠喝西北风度日。
多亏先头部队到延寿（汝城某地）时，当地的老表们心善，答应帮助我们筹集粮食。听炊事班的大哥说，这次筹来了一百多担稻谷，还有些牲口，已经送到叶司务手里，我们阻击完这批追兵回到延寿，就能有热乎乎的高粱糍粑吃了。
我昨晚做梦了，梦到咱们每个穷人都能住进敞亮的房子，吃热乎乎的白米饭，还能舒舒服服种自己的地。咱们“革命的星火”那是真的传遍“神州”了。

    `
  },
  {
    date: ' 1937年11月16日',
    text: `
    真舍不得离开郴县，但一转眼，明天还是得走了。大柱哥开导我不要难过——“哪里都需要革命的火种哇”。可是哪能不难过呢？好不容易才从战火里得到喘息，如今又要投身进去。
  况且，谁能舍得郴县的人们啊，我还记得我把从地主家里缴来的衣物分给接纳我们的那户人家，那家人人眼里的欣喜与紧张，他们遭受了多少苦难，他们还需要我们的帮助！
这些善良的人们，我还记得他们无偿的照料我们的伤员、在自己都吃不饱的情况下筹措粮草。我的脚上还穿着良田女游击队同志捺的新布鞋。
而我如今却要穿着这鞋上路，离开又一个家乡。

    `
  },
  {
    date: ' 1934年12月2日',
    text: `
    大柱兄弟战死了。不只是他，其他的红十八团兄弟们也全都战死了。
昨天刚听到这个消息的时候，我就像被雷劈中了一样，还没缓过神来，眼泪就“哇哇”的流。今早想招呼他一起上路，又想起这个事，心里真是空落落的。
谁能想到几天前还活蹦乱跳的人，现在却连尸体都没个完整。不止是大柱，整个队伍也被打得七零八落。这仗是打得真的惨啊，哪些个桂军先是用大炮打我们，乘着不备时一边正着打，一边迎合着背后围攻，还拿飞机在天上“嗷嗷”轰炸，变着法打。
队伍里那些没被炸死、扫射死的，被逼的没办法，只能扛着命和他们搞“白刃战”。像我这样侥幸活下来的，怕也难挨过湘江啊。我还是想不明白，为什么自己人要打自己…… 

    `
  }
]